report/sysbench/SSP_test/oltp_point_select.master_ssp_200.txt
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 200
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 200 tps: 112867.26 qps: 112867.26 (r/w/o: 112867.26/0.00/0.00) lat (ms,99%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 200 tps: 186086.07 qps: 186086.07 (r/w/o: 186086.07/0.00/0.00) lat (ms,99%): 2.39 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 200 tps: 179812.88 qps: 179812.88 (r/w/o: 179812.88/0.00/0.00) lat (ms,99%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 200 tps: 186171.66 qps: 186171.66 (r/w/o: 186171.66/0.00/0.00) lat (ms,99%): 2.48 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 200 tps: 180041.83 qps: 180041.83 (r/w/o: 180041.83/0.00/0.00) lat (ms,99%): 2.35 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 200 tps: 181900.00 qps: 181900.00 (r/w/o: 181900.00/0.00/0.00) lat (ms,99%): 2.30 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 200 tps: 182218.72 qps: 182218.72 (r/w/o: 182218.72/0.00/0.00) lat (ms,99%): 2.35 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 200 tps: 184103.64 qps: 184103.64 (r/w/o: 184103.64/0.00/0.00) lat (ms,99%): 2.48 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 200 tps: 179025.82 qps: 179025.82 (r/w/o: 179025.82/0.00/0.00) lat (ms,99%): 2.30 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 200 tps: 184624.19 qps: 184624.19 (r/w/o: 184624.19/0.00/0.00) lat (ms,99%): 2.35 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 200 tps: 188018.41 qps: 188018.41 (r/w/o: 188018.41/0.00/0.00) lat (ms,99%): 2.39 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 200 tps: 182794.41 qps: 182794.41 (r/w/o: 182794.41/0.00/0.00) lat (ms,99%): 2.35 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 200 tps: 183837.15 qps: 183837.15 (r/w/o: 183837.15/0.00/0.00) lat (ms,99%): 2.35 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 200 tps: 188077.87 qps: 188077.87 (r/w/o: 188077.87/0.00/0.00) lat (ms,99%): 2.39 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 200 tps: 188542.28 qps: 188542.28 (r/w/o: 188542.28/0.00/0.00) lat (ms,99%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 200 tps: 187047.99 qps: 187047.99 (r/w/o: 187047.99/0.00/0.00) lat (ms,99%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 200 tps: 188004.81 qps: 188004.81 (r/w/o: 188004.81/0.00/0.00) lat (ms,99%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 200 tps: 189708.58 qps: 189708.58 (r/w/o: 189708.58/0.00/0.00) lat (ms,99%): 2.35 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 200 tps: 188276.03 qps: 188276.03 (r/w/o: 188276.03/0.00/0.00) lat (ms,99%): 2.30 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 200 tps: 182573.83 qps: 182573.83 (r/w/o: 182573.83/0.00/0.00) lat (ms,99%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 200 tps: 181555.02 qps: 181554.82 (r/w/o: 181554.82/0.00/0.00) lat (ms,99%): 2.30 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 200 tps: 184878.17 qps: 184878.37 (r/w/o: 184878.37/0.00/0.00) lat (ms,99%): 2.39 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 200 tps: 187984.42 qps: 187984.42 (r/w/o: 187984.42/0.00/0.00) lat (ms,99%): 2.30 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 200 tps: 188596.78 qps: 188596.78 (r/w/o: 188596.78/0.00/0.00) lat (ms,99%): 2.26 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            21834906
        write:                           0
        other:                           0
        total:                           21834906
    transactions:                        21834906 (181820.73 per sec.)
    queries:                             21834906 (181820.73 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0890s
    total number of events:              21834906

Latency (ms):
         min:                                    0.30
         avg:                                    1.10
         max:                                  402.88
         99th percentile:                        2.48
         sum:                             23992010.48

Threads fairness:
    events (avg/stddev):           109174.5300/993.71
    execution time (avg/stddev):   119.9601/0.01