report/sysbench/SSP_test/oltp_read_only.master_ssm_200.txt
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 200
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 200 tps: 13058.69 qps: 156940.11 (r/w/o: 130782.96/0.00/26157.15) lat (ms,99%): 21.89 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 200 tps: 13713.98 qps: 164597.82 (r/w/o: 137170.85/0.00/27426.97) lat (ms,99%): 23.95 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 200 tps: 13666.13 qps: 164010.55 (r/w/o: 136677.49/0.00/27333.06) lat (ms,99%): 23.52 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 200 tps: 13673.85 qps: 164079.62 (r/w/o: 136732.71/0.00/27346.90) lat (ms,99%): 23.10 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 200 tps: 13480.29 qps: 161755.64 (r/w/o: 134795.27/0.00/26960.37) lat (ms,99%): 23.52 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 200 tps: 12774.26 qps: 153291.96 (r/w/o: 127743.24/0.00/25548.73) lat (ms,99%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 200 tps: 12384.00 qps: 148593.98 (r/w/o: 123826.18/0.00/24767.80) lat (ms,99%): 23.52 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 200 tps: 12354.23 qps: 148236.74 (r/w/o: 123529.28/0.00/24707.46) lat (ms,99%): 23.10 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 200 tps: 12428.53 qps: 149173.19 (r/w/o: 124314.52/0.00/24858.66) lat (ms,99%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 200 tps: 12414.14 qps: 148959.45 (r/w/o: 124130.77/0.00/24828.67) lat (ms,99%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 200 tps: 12393.36 qps: 148726.53 (r/w/o: 123940.41/0.00/24786.12) lat (ms,99%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 200 tps: 12371.81 qps: 148435.31 (r/w/o: 123691.49/0.00/24743.82) lat (ms,99%): 23.52 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 200 tps: 12353.95 qps: 148267.34 (r/w/o: 123559.85/0.00/24707.49) lat (ms,99%): 23.52 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 200 tps: 12387.26 qps: 148653.15 (r/w/o: 123879.42/0.00/24773.72) lat (ms,99%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 200 tps: 12351.73 qps: 148221.92 (r/w/o: 123517.07/0.00/24704.85) lat (ms,99%): 23.52 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 200 tps: 12342.89 qps: 148117.64 (r/w/o: 123431.87/0.00/24685.77) lat (ms,99%): 21.89 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 200 tps: 12250.27 qps: 146993.68 (r/w/o: 122493.93/0.00/24499.75) lat (ms,99%): 24.38 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 200 tps: 13006.82 qps: 156081.48 (r/w/o: 130068.43/0.00/26013.05) lat (ms,99%): 23.10 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 200 tps: 12870.43 qps: 154480.31 (r/w/o: 128737.85/0.00/25742.45) lat (ms,99%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 200 tps: 13650.67 qps: 163775.49 (r/w/o: 136474.94/0.00/27300.55) lat (ms,99%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 200 tps: 13693.47 qps: 164320.01 (r/w/o: 136932.47/0.00/27387.53) lat (ms,99%): 23.10 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 200 tps: 13683.59 qps: 164204.07 (r/w/o: 136838.09/0.00/27365.98) lat (ms,99%): 22.28 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 200 tps: 13656.44 qps: 163878.06 (r/w/o: 136564.18/0.00/27313.88) lat (ms,99%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 200 tps: 12937.45 qps: 155250.36 (r/w/o: 129380.67/0.00/25869.69) lat (ms,99%): 21.50 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            15497130
        write:                           0
        other:                           3099426
        total:                           18596556
    transactions:                        1549713 (12910.28 per sec.)
    queries:                             18596556 (154923.38 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0358s
    total number of events:              1549713

Latency (ms):
         min:                                    7.68
         avg:                                   15.49
         max:                                  226.62
         99th percentile:                       22.69
         sum:                             24000472.78

Threads fairness:
    events (avg/stddev):           7748.5650/33.10
    execution time (avg/stddev):   120.0024/0.01