report/sysbench/SSP_test/oltp_read_only.master_ssp_200.txt
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 200
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 200 tps: 12855.46 qps: 154514.48 (r/w/o: 128763.80/0.00/25750.68) lat (ms,99%): 24.38 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 200 tps: 12821.06 qps: 153857.10 (r/w/o: 128215.58/0.00/25641.52) lat (ms,99%): 28.16 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 200 tps: 12799.04 qps: 153581.67 (r/w/o: 127984.99/0.00/25596.68) lat (ms,99%): 25.74 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 200 tps: 12704.68 qps: 152455.31 (r/w/o: 127044.56/0.00/25410.75) lat (ms,99%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 200 tps: 12870.57 qps: 154437.24 (r/w/o: 128695.50/0.00/25741.74) lat (ms,99%): 23.52 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 200 tps: 12841.34 qps: 154109.47 (r/w/o: 128427.39/0.00/25682.08) lat (ms,99%): 23.95 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 200 tps: 12853.47 qps: 154236.05 (r/w/o: 128528.91/0.00/25707.14) lat (ms,99%): 23.95 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 200 tps: 11950.73 qps: 143418.13 (r/w/o: 119516.27/0.00/23901.85) lat (ms,99%): 23.52 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 200 tps: 11642.30 qps: 139708.25 (r/w/o: 116424.24/0.00/23284.01) lat (ms,99%): 25.28 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 200 tps: 11811.06 qps: 141714.16 (r/w/o: 118092.83/0.00/23621.33) lat (ms,99%): 23.52 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 200 tps: 12008.83 qps: 144107.19 (r/w/o: 120088.53/0.00/24018.67) lat (ms,99%): 23.95 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 200 tps: 12063.38 qps: 144765.31 (r/w/o: 120638.56/0.00/24126.75) lat (ms,99%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 200 tps: 12641.04 qps: 151693.07 (r/w/o: 126411.59/0.00/25281.48) lat (ms,99%): 23.52 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 200 tps: 12827.08 qps: 153929.73 (r/w/o: 128276.77/0.00/25652.95) lat (ms,99%): 23.52 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 200 tps: 12944.05 qps: 155355.64 (r/w/o: 129465.34/0.00/25890.31) lat (ms,99%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 200 tps: 12247.93 qps: 146940.41 (r/w/o: 122446.14/0.00/24494.27) lat (ms,99%): 23.95 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 200 tps: 11572.16 qps: 138887.36 (r/w/o: 115742.44/0.00/23144.93) lat (ms,99%): 24.83 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 200 tps: 11549.92 qps: 138597.48 (r/w/o: 115497.24/0.00/23100.25) lat (ms,99%): 22.28 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 200 tps: 11514.72 qps: 138168.08 (r/w/o: 115138.23/0.00/23029.85) lat (ms,99%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 200 tps: 11479.02 qps: 137740.85 (r/w/o: 114783.01/0.00/22957.84) lat (ms,99%): 25.74 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 200 tps: 11440.77 qps: 137283.28 (r/w/o: 114402.93/0.00/22880.35) lat (ms,99%): 23.52 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 200 tps: 11426.96 qps: 137120.27 (r/w/o: 114265.75/0.00/22854.51) lat (ms,99%): 24.83 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 200 tps: 11536.25 qps: 138431.14 (r/w/o: 115359.05/0.00/23072.09) lat (ms,99%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 200 tps: 11511.44 qps: 138153.85 (r/w/o: 115133.38/0.00/23020.48) lat (ms,99%): 24.83 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            14597940
        write:                           0
        other:                           2919588
        total:                           17517528
    transactions:                        1459794 (12157.95 per sec.)
    queries:                             17517528 (145895.43 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0677s
    total number of events:              1459794

Latency (ms):
         min:                                    9.81
         avg:                                   16.44
         max:                                  228.97
         99th percentile:                       23.95
         sum:                             23999984.15

Threads fairness:
    events (avg/stddev):           7298.9700/25.95
    execution time (avg/stddev):   119.9999/0.01